:PROPERTIES:
:ID:       b422e147-3572-43de-bc62-821c53e540f7
:END:
#+title: elisp-lang-list
#+date: [2024-07-25 周四]
#+last_modified:  



#+begin_src emacs-lisp 
  (+ 2 2)

  (concat "abc" "def")

  (substring "abcdefg" 0 3)


  (integer-or-marker-p 3)

  (message "a msg")

  (message "%d>>>%s" 123 "a c-like placeholder")


  (set 'anims '(mouse tiger rabbit))
  (setq anims '(lion tiger leopard))


  (setq counter 0)
  (setq counter (+ counter 1))
  counter

  
#+end_src

#+RESULTS:
: 4




* Index
- [[id:480ca7c9-2bb0-4d94-be41-47b5a7021f1a][elisp-mapc]]
- [[id:bf273182-0a93-429b-b3f3-0163334bbaf9][elisp-mapcar]]
